backend/data/simulations/Kapem/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1170;
        startFace       279488;
    }
    inlet
    {
        type            patch;
        nFaces          112;
        startFace       280658;
    }
    outlet
    {
        type            patch;
        nFaces          68;
        startFace       280770;
    }
    plaque
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4358;
        startFace       280838;
    }
)

// ************************************************************************* //
